{"0":{"id":1652367268,"title":"Why and how to use ESLint in your project","image":"https:\/\/blog.dyma.fr\/content\/images\/size\/w750\/2021\/09\/javascript1200x628.png","category":"js","content":"Npmjs.org has hundreds of thousands of packages, but they aren't all of equal quality. It's important to check how well managed your direct dependencies are. No single missing management practice should eliminate a package from your consideration if the features are right, but when you have a choice of packages, pick ones that are well managed &mdash; or be prepared to maintain the package yourself!"},"1":{"id":1652367347,"title":"How to Send Mail Notification in Laravel","image":"https:\/\/www.gekkode.com\/wp-content\/uploads\/2022\/02\/laravel-9-0.png","category":"laravel","content":"Many laravel beginners has one question were to use laravel notification in our laravel application. so, we i will give you some real field examples for laravel notification functionality. like when we work with web-based ERP and send users some invoices as well as store some related data into the database then notification it will be very helpful. laravel provide to developer many ways to send notification by notification class 1.) mail, 2.) store into a database, 3.) by broadcast (use for real-time notification by pusher and Redis), 4.) slack"},"2":{"id":1652367492,"title":"Making a Shoutbox with PHP and jQuery","image":"https:\/\/www.solutions-numeriques.com\/wp-content\/uploads\/2015\/05\/php_logo.png","category":"php","content":"In this tutorial, we are going to build a shout box with PHP and jQuery, which allows visitors of your website to leave short comments to one another. Shouts will be stored on the server as files, no database like MySQL will be required. We are going to use two PHP libraries to make things easier - Flywheel for storing the shouts as json files and RelativeTime for creating human readable relative time stamps. We will be using Composer to install these libraries."},"3":{"id":1652367558,"title":"l&#039;&eacute;l&eacute;ment de contenu d&#039;un article","image":"https:\/\/www.develop4fun.fr\/wp-content\/uploads\/2019\/08\/html-2.jpg","category":"html","content":"L'&eacute;l&eacute;ment &lt;article&gt; repr&eacute;sente une composition autonome dans un document, une page, une application ou un site, destin&eacute;e &agrave; &ecirc;tre distribu&eacute;e ou r&eacute;utilis&eacute;e de mani&egrave;re ind&eacute;pendante (par exemple, dans le cadre d'une syndication). Exemples : un message de forum, un article de magazine ou de journal, ou un article de blog, une fiche produit, un commentaire soumis par un utilisateur, un widget ou gadget interactif, ou tout autre &eacute;l&eacute;ment de contenu ind&eacute;pendant."},"4":{"id":1652367633,"title":"A CSS Slinky in 3D? Challenge Accepted!","image":"https:\/\/encrypted-tbn0.gstatic.com\/images?q=tbn:ANd9GcTkdDy1MPyAklifM98twCxSuRj7EVJPO0cmHg&usqp=CAU","category":"css","content":"Braydon Coyer recently launched a monthly CSS art challenge. He actually had reached out to me about donating a copy of my book Move Things with CSS to use as a prize for the winner of the challenge &mdash; which I was more than happy to do!\r\n\r\nThe first month&rsquo;s challenge? Spring. And when thinking of what to make for the challenge, Slinkys immediately came to mind. You know Slinkys, right? That classic toy you knock down the stairs and it travels with its own momentum."}
}